# Pandas
## How to use

In [195]:
import pandas as pd
import numpy as np

In [196]:
s_data = pd.Series([0.25, 0.50, 0.75, 1.0])

In [197]:
print(s_data)
print(type(s_data))

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64
<class 'pandas.core.series.Series'>

In [198]:
s_data[1]

0.5

In [199]:
print(s_data.values)
print(s_data.index)

[0.25 0.5  0.75 1.  ]
RangeIndex(start=0, stop=4, step=1)

In [200]:
s_data = pd.Series([0.25, 0.50, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

In [201]:
s_data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [202]:
s_data['b']

0.5

In [203]:
s_data = pd.Series([0.25, 0.50, 0.75, 1.0], index=[2, 5, 3, 7])

In [204]:
s_data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [205]:
s_data[5]

0.5

### Series as a specialized dictionary

In [206]:
population_dict = {
    'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
    'Florida': 19552860,
    'Illionis': 12882135
}

In [207]:
population = pd.Series(population_dict)

In [208]:
type(population)

pandas.core.series.Series

In [209]:
population['California']

38332521

In [210]:
population['Texas':'Florida']

Texas       26448193
New York    19651127
Florida     19552860
dtype: int64

In [211]:
population.sort_values()

Illionis      12882135
Florida       19552860
New York      19651127
Texas         26448193
California    38332521
dtype: int64

In [212]:
# Create Seris object using Scalar value
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [213]:
pd.Series({2: 'a', 1: 'b', 3: 'c'}, index=[3, 2])

3    c
2    a
dtype: object

### Create data frame

In [214]:
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illionis      12882135
dtype: int64

In [215]:
area_dict = {
    'California': 423967,
    'Texas': 695692,
    'New York': 141297,
    'Florida': 170312,
    'Illionis': 149995
}

In [216]:
area = pd.Series(area_dict)

In [217]:
states = pd.DataFrame({
    'Population': population, 
    'Area': area
})

In [218]:
states

            Population    Area
California    38332521  423967
Texas         26448193  695692
New York      19651127  141297
Florida       19552860  170312
Illionis      12882135  149995

In [219]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illionis'], dtype='object')

In [220]:
states.columns

Index(['Population', 'Area'], dtype='object')

In [221]:
states['Area']

California    423967
Texas         695692
New York      141297
Florida       170312
Illionis      149995
Name: Area, dtype: int64

### Constructing DataFrame object
- From a single Series object
- From a list of dictionaries
- From a dictionary of Series objects
- From a dimensional NumPy array
- From a NumPy stucted array

In [222]:
print(type(population))
print(type(states))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [223]:
# Create a datafram with a list of dictionaries
data = [{
    'a': 1,
    'b': 2 * i
} for i in range(3)]

In [224]:
print(data)
print(type(data))

[{'a': 1, 'b': 0}, {'a': 1, 'b': 2}, {'a': 1, 'b': 4}]
<class 'list'>

In [225]:
print(pd.DataFrame(data))
print(type(pd.DataFrame(data)))

   a  b
0  1  0
1  1  2
2  1  4
<class 'pandas.core.frame.DataFrame'>

In [226]:
# Dataframe can handle missing values
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [227]:
# Creat Dataframe using two-dimensional NumPy array
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'], 
             index=['a', 'b', 'c'])

        foo       bar
a  0.823871  0.454365
b  0.522143  0.248935
c  0.524139  0.081091

### Index as orderedd set

In [228]:
# Create an Index from the list of integers
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [229]:
ind[1]

3

In [230]:
# Index does not support mutable operations
ind[0] = 1

TypeError: Index does not support mutable operations

In [ ]:
ind_a = pd.Index([1, 3, 5, 7, 9])
ind_b = pd.Index([2, 3, 5, 7, 11])

In [ ]:
ind_a & ind_b

C:\Users\eddie\AppData\Local\Temp\ipykernel_14312\4201416644.py:1: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead.
  ind_a & ind_b

Int64Index([3, 5, 7], dtype='int64')

In [ ]:
ind_a.intersection(ind_b)

Int64Index([3, 5, 7], dtype='int64')

In [ ]:
ind_a | ind_b

C:\Users\eddie\AppData\Local\Temp\ipykernel_14312\2872757766.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  ind_a | ind_b

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [ ]:
ind_a.union(ind_b)

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [ ]:
ind_a ^ ind_b

C:\Users\eddie\AppData\Local\Temp\ipykernel_14312\182274355.py:1: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead.
  ind_a ^ ind_b

Int64Index([1, 2, 9, 11], dtype='int64')

In [ ]:
ind_a.symmetric_difference(ind_b)

Int64Index([1, 2, 9, 11], dtype='int64')

### Data Indexing and Selection

- Series as dictionary

In [ ]:
data = pd.Series([0.25, 0.50, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

In [ ]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [ ]:
'a' in data

True

In [ ]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [ ]:
data['e'] = 1.25

In [ ]:
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [ ]:
# Slicing using explicit indexing
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [ ]:
# Slicing using implicit indexing
data[0:2]

a    0.25
b    0.50
dtype: float64

In [ ]:
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [ ]:
# Masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [ ]:
# Fancy indexing, list of indices
data[['a', 'd']]

a    0.25
d    1.00
dtype: float64

### Indexer loc and iloc

In [ ]:
data = pd.Series(
    ['a', 'b', 'c'], 
    index=[1, 3, 5]
)
data

1    a
3    b
5    c
dtype: object

In [ ]:
# To access data using index it using explicit indexing
data[1]

'a'

In [ ]:
# To access data using index it using implicit indexing
data[1:3]

3    b
5    c
dtype: object

In [ ]:
# 'loc' use explcit indexing
data.loc[1]

'a'

In [ ]:
# iloc use implicit indexing
data.iloc[1]

'b'

### Data Selection in dataframe

#### DataFram as a dictionary

In [ ]:
pop = pd.Series({
    'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
    'Florida': 19552860,
    'Illionis': 12882135
})

In [ ]:
area = pd.Series({
    'California': 423967,
    'Texas': 695692,
    'New York': 141297,
    'Florida': 170312,
    'Illionis': 149995
})

In [ ]:
data = pd.DataFrame({
    'area': area,
    'pop': pop,
})

In [ ]:
data

              area       pop
California  423967  38332521
Texas       695692  26448193
New York    141297  19651127
Florida     170312  19552860
Illionis    149995  12882135

In [ ]:
# Dictinary stlye indexing
data['area']

California    423967
Texas         695692
New York      141297
Florida       170312
Illionis      149995
Name: area, dtype: int64

In [ ]:
# Attribute type
data.area

California    423967
Texas         695692
New York      141297
Florida       170312
Illionis      149995
Name: area, dtype: int64

In [ ]:
data.area is data['area']

True

In [ ]:
data.pop

<bound method DataFrame.pop of               area       pop
California  423967  38332521
Texas       695692  26448193
New York    141297  19651127
Florida     170312  19552860
Illionis    149995  12882135>

In [ ]:
data.pop is data['pop']

False

In [ ]:
# Avoid using attribute style "data.pop"
data['pop']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illionis      12882135
Name: pop, dtype: int64

In [ ]:
data['dens'] = data['pop'] / data['area']

In [ ]:
data

              area       pop        dens
California  423967  38332521   90.413926
Texas       695692  26448193   38.017101
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illionis    149995  12882135   85.883763

In [ ]:
# Get the values of the dataframe
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95692000e+05, 2.64481930e+07, 3.80171010e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [ ]:
# Get first row
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [ ]:
# Slicing using implicit indexing
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695692  26448193
New York    141297  19651127

In [ ]:
# Explicit index include the final index
data.loc[:'New York', :'pop']

              area       pop
California  423967  38332521
Texas       695692  26448193
New York    141297  19651127

In [ ]:
# 'loc' and 'iloc' can combine masking and fancy indexing
data.loc[data.dens > 100, ['pop', 'dens']]

               pop        dens
New York  19651127  139.076746
Florida   19552860  114.806121

In [ ]:
# Modify dataframe using iloc
data.iloc[0, 2] = 90

In [ ]:
data

              area       pop        dens
California  423967  38332521   90.000000
Texas       695692  26448193   38.017101
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illionis    149995  12882135   85.883763

### Operating on data in Pandas

In [ ]:
# Series
rng = np.random.RandomState(42)

ser = pd.Series(rng.randint(0, 10, 4))

ser

0    6
1    3
2    7
3    4
dtype: int32

In [ ]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)), columns=['a', 'b', 'c', 'd'])
df

   a  b  c  d
0  6  3  8  2
1  4  2  6  4
2  8  6  1  3

In [ ]:
# Index preserves in series
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [ ]:
# Index preserves in dataframe
np.sin(df * np.pi / 4)

              a         b             c             d
0 -1.000000e+00  0.707107 -2.449294e-16  1.000000e+00
1  1.224647e-16  1.000000 -1.000000e+00  1.224647e-16
2 -2.449294e-16 -1.000000  7.071068e-01  7.071068e-01

### Index alignment in series

In [ ]:
area = pd.Series({
    'California': 423967,
    'New York': 141297,
    'Florida': 170312,
    'Illionis': 149995
})

In [ ]:
population = pd.Series({
    'California': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
    'Illionis': 12882135
})

In [ ]:
area / population

California    0.011060
Florida            NaN
Illionis      0.011644
New York      0.007190
Texas              NaN
dtype: float64

In [ ]:
area.index.union(population.index)

Index(['California', 'Florida', 'Illionis', 'New York', 'Texas'], dtype='object')

### Index alignment in dataframe

In [ ]:
a = pd.DataFrame(rng.randint(0, 20, (2, 2)), columns=list('xy'))

In [ ]:
a

   x  y
0  7  3
1  1  5

In [ ]:
b = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('xyz'))

In [ ]:
b

   x  y  z
0  5  9  3
1  5  1  9
2  1  9  3

In [ ]:
a + b

      x     y   z
0  12.0  12.0 NaN
1   6.0   6.0 NaN
2   NaN   NaN NaN

In [ ]:
fill = a.stack().mean()

In [ ]:
a.add(b, fill_value=fill)

      x     y     z
0  12.0  12.0   7.0
1   6.0   6.0  13.0
2   5.0  13.0   7.0